nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimx952/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitTPMPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitTPMPins(void) {                            /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO13__TPM4_CH2, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO25__TPM4_CH3, 0U);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLPSPIPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: L45, peripheral: LPSPI7, signal: lpspi_sin, pin_signal: GPIO_IO05, PD: ENABLED}
  - {pin_num: K46, peripheral: LPSPI7, signal: 'lpspi_pcs, 0', pin_signal: GPIO_IO04, PD: ENABLED}
  - {pin_num: L49, peripheral: LPSPI7, signal: lpspi_sout, pin_signal: GPIO_IO06, PD: ENABLED}
  - {pin_num: L51, peripheral: LPSPI7, signal: lpspi_sck, pin_signal: GPIO_IO07, PD: ENABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLPSPIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLPSPIPins(void) {                           /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO04__LPSPI7_PCS0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO04__LPSPI7_PCS0, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO05__LPSPI7_SIN, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO05__LPSPI7_SIN, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO06__LPSPI7_SOUT, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO06__LPSPI7_SOUT, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO07__LPSPI7_SCK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO07__LPSPI7_SCK, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_DeInitLPSPIPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: L45, peripheral: GPIO2, signal: 'gpio_io_, 5', pin_signal: GPIO_IO05}
  - {pin_num: K46, peripheral: GPIO2, signal: 'gpio_io_, 4', pin_signal: GPIO_IO04}
  - {pin_num: L49, peripheral: GPIO2, signal: 'gpio_io_, 6', pin_signal: GPIO_IO06}
  - {pin_num: L51, peripheral: GPIO2, signal: 'gpio_io_, 7', pin_signal: GPIO_IO07}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_DeInitLPSPIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_DeInitLPSPIPins(void) {                         /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO04__GPIO2_IO_4, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO05__GPIO2_IO_5, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO06__GPIO2_IO_6, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO07__GPIO2_IO_7, 0U);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI2C4Pins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: V46, peripheral: LPI2C4, signal: lpi2c_sda, pin_signal: GPIO_IO30, SION: ENABLED, OD: ENABLED, PD: DISABLED}
  - {pin_num: V48, peripheral: LPI2C4, signal: lpi2c_scl, pin_signal: GPIO_IO31, SION: ENABLED, OD: ENABLED, PD: DISABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI2C4Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitI2C4Pins(void) {                            /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO30__LPI2C4_SDA, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO30__LPI2C4_SDA, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO31__LPI2C4_SCL, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO31__LPI2C4_SCL, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSAIPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: P46, peripheral: AUDMIX, signal: audmix_tdm_out_txbclk, pin_signal: GPIO_IO16, SION: ENABLED, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: U45, peripheral: AUDMIX, signal: audmix_tdm_out_txsync, pin_signal: GPIO_IO26, SION: ENABLED, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: R51, peripheral: AUDMIX, signal: audmix_tdm_out_txdata, pin_signal: GPIO_IO21, SION: ENABLED, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: P48, peripheral: SAI3, signal: sai_mclk, pin_signal: GPIO_IO17, SION: ENABLED, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: R49, peripheral: SAI3, signal: 'sai_rx_data_, 0', pin_signal: GPIO_IO20, SION: ENABLED, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

