nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimx952/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_DeInitI2C6Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_DeInitI2C6Pins(void) {                          /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO02__GPIO2_IO_2, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO03__GPIO2_IO_3, 0U);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitXSPIPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: AJ43, peripheral: XSPI1, signal: xspi_a_sclk, pin_signal: XSPI1_SCLK, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: AH42, peripheral: XSPI1, signal: xspi_a_ss_b, pin_signal: XSPI1_SS1_B, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: AJ41, peripheral: XSPI1, signal: xspi_a_ss_b, pin_signal: XSPI1_SS0_B, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: AK44, peripheral: XSPI1, signal: xspi_a_dqs, pin_signal: XSPI1_DQS, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: AJ45, peripheral: XSPI1, signal: 'xspi_a_data_, 0', pin_signal: XSPI1_DATA0, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: AH46, peripheral: XSPI1, signal: 'xspi_a_data_, 1', pin_signal: XSPI1_DATA1, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: AJ47, peripheral: XSPI1, signal: 'xspi_a_data_, 2', pin_signal: XSPI1_DATA2, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: AK48, peripheral: XSPI1, signal: 'xspi_a_data_, 3', pin_signal: XSPI1_DATA3, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: AJ49, peripheral: XSPI1, signal: 'xspi_a_data_, 4', pin_signal: XSPI1_DATA4, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: AH50, peripheral: XSPI1, signal: 'xspi_a_data_, 7', pin_signal: XSPI1_DATA7, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: AK50, peripheral: XSPI1, signal: 'xspi_a_data_, 5', pin_signal: XSPI1_DATA5, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: AJ51, peripheral: XSPI1, signal: 'xspi_a_data_, 6', pin_signal: XSPI1_DATA6, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitXSPIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitXSPIPins(void) {                            /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA0__XSPI1_A_DATA_0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA0__XSPI1_A_DATA_0, 
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA1__XSPI1_A_DATA_1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA1__XSPI1_A_DATA_1, 
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA2__XSPI1_A_DATA_2, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA2__XSPI1_A_DATA_2, 
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA3__XSPI1_A_DATA_3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA3__XSPI1_A_DATA_3, 
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA4__XSPI1_A_DATA_4, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA4__XSPI1_A_DATA_4, 
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA5__XSPI1_A_DATA_5, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA5__XSPI1_A_DATA_5, 
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA6__XSPI1_A_DATA_6, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA6__XSPI1_A_DATA_6, 
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA7__XSPI1_A_DATA_7, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA7__XSPI1_A_DATA_7, 
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DQS__XSPI1_A_DQS, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DQS__XSPI1_A_DQS, 
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_SCLK__XSPI1_A_SCLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_SCLK__XSPI1_A_SCLK, 
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_SS0_B__XSPI1_A_SS0_B, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_SS0_B__XSPI1_A_SS0_B, 
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_SS1_B__XSPI1_A_SS1_B, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_SS1_B__XSPI1_A_SS1_B, 
                        IOMUXC_PAD_DSE(15U));
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI2C3Pins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: J49, peripheral: LPI2C3, signal: lpi2c_sda, pin_signal: GPIO_IO00, SION: ENABLED, OD: ENABLED, PD: DISABLED}
  - {pin_num: J51, peripheral: LPI2C3, signal: lpi2c_scl, pin_signal: GPIO_IO01, SION: ENABLED, OD: ENABLED, PD: DISABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI2C3Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitI2C3Pins(void) {                            /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO00__LPI2C3_SDA, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO00__LPI2C3_SDA, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO01__LPI2C3_SCL, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO01__LPI2C3_SCL, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
}


