nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimx952/common/pin_mux/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCLKOPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: AH20, peripheral: CCMSRCGPCMIX, signal: 'ccmsrcgpcmix_clko, 1', pin_signal: CCM_CLKO1, SION: ENABLED, OD: DISABLED, PD: DISABLED, PU: ENABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCLKOPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCLKOPins(void) {                            /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_CCM_CLKO1__CLKO_1, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_CCM_CLKO1__CLKO_1, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PU_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXIOPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: M44, peripheral: FLEXIO1, signal: 'flexio_flexio_, 8', pin_signal: GPIO_IO08, SION: ENABLED, OD: ENABLED, PD: DISABLED, PU: DISABLED}
  - {pin_num: M46, peripheral: FLEXIO1, signal: 'flexio_flexio_, 9', pin_signal: GPIO_IO09, SION: ENABLED, OD: ENABLED, PD: DISABLED, PU: DISABLED}
  - {pin_num: K48, peripheral: FLEXIO1, signal: 'flexio_flexio_, 2', pin_signal: GPIO_IO02, SION: ENABLED, OD: DISABLED, PD: DISABLED}
  - {pin_num: K52, peripheral: FLEXIO1, signal: 'flexio_flexio_, 3', pin_signal: GPIO_IO03, SION: ENABLED, PD: DISABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXIOPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFLEXIOPins(void) {                          /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO02__FLEXIO1_FLEXIO_2, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO02__FLEXIO1_FLEXIO_2, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO03__FLEXIO1_FLEXIO_3, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO03__FLEXIO1_FLEXIO_3, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO08__FLEXIO1_FLEXIO_8, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO08__FLEXIO1_FLEXIO_8, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO09__FLEXIO1_FLEXIO_9, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO09__FLEXIO1_FLEXIO_9, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI3CPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: AJ39, peripheral: I3C2, signal: i3c_sda, pin_signal: ENET1_MDIO, SION: ENABLED}
  - {pin_num: AK40, peripheral: I3C2, signal: i3c_scl, pin_signal: ENET1_MDC, SION: ENABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI3CPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitI3CPins(void) {                             /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_MDC__I3C2_SCL, 1U);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_MDIO__I3C2_SDA, 1U);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLVDSPWMPins:
- options: {callFromInitBoot: 'true', coreID: cm7}
- pin_list:
  - {pin_num: N49, peripheral: GPIO2, signal: 'gpio_io, 13', pin_signal: GPIO_IO13, OD: ENABLED, PD: DISABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLVDSPWMPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLVDSPWMPins(void) {                         /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO13__GPIO2_IO_13, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO13__GPIO2_IO_13,
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitGPIO2Pins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: V44, peripheral: GPIO2, signal: 'gpio_io_, 29', pin_signal: GPIO_IO29, PD: DISABLED}
  - {pin_num: K52, peripheral: GPIO2, signal: 'gpio_io_, 3', pin_signal: GPIO_IO03, PD: ENABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

