nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimx952/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitGPIO2Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitGPIO2Pins(void) {                           /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO03__GPIO2_IO_3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO03__GPIO2_IO_3, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO29__GPIO2_IO_29, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO29__GPIO2_IO_29, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_DeInitDEBUG_UARTPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: N51, peripheral: GPIO2, signal: 'gpio_io_, 14', pin_signal: GPIO_IO14}
  - {pin_num: P44, peripheral: GPIO2, signal: 'gpio_io_, 15', pin_signal: GPIO_IO15}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_DeInitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_DeInitDEBUG_UARTPins(void) {                    /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO14__GPIO2_IO_14, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO15__GPIO2_IO_15, 0U);
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitMQSPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: AA45, peripheral: MQS1, signal: mqs_left, pin_signal: SAI1_TXFS, DSE: X6}
  - {pin_num: AB47, peripheral: MQS1, signal: mqs_right, pin_signal: SAI1_RXD0, DSE: X6}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitMQSPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitMQSPins(void) {                             /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_SAI1_TXFS__MQS1_LEFT, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_SAI1_TXFS__MQS1_LEFT,
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_SAI1_RXD0__MQS1_RIGHT, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_SAI1_RXD0__MQS1_RIGHT,
                        IOMUXC_PAD_DSE(15U));
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
